[Killed] BlockStatement
src/salarios.ts:1:91
-export function calcularSalarioLiquido(salarioBruto: number, descontos: number[]): number {
-  const totalDescontos = descontos.reduce((acc, curr) => acc + curr, 0);
-  return salarioBruto - totalDescontos;
-}
+export function calcularSalarioLiquido(salarioBruto: number, descontos: number[]): number {}
 
killedBy: Funções de salário calcula salário líquido com descontos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4000
Received: undefined

[Killed] ArrowFunction
src/salarios.ts:2:43
 export function calcularSalarioLiquido(salarioBruto: number, descontos: number[]): number {
-  const totalDescontos = descontos.reduce((acc, curr) => acc + curr, 0);
+  const totalDescontos = descontos.reduce(() => undefined, 0);
   return salarioBruto - totalDescontos;
 }
killedBy: Funções de salário calcula salário líquido com descontos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4000
Received: NaN

[Killed] ArithmeticOperator
src/salarios.ts:2:58
 export function calcularSalarioLiquido(salarioBruto: number, descontos: number[]): number {
-  const totalDescontos = descontos.reduce((acc, curr) => acc + curr, 0);
+  const totalDescontos = descontos.reduce((acc, curr) => acc - curr, 0);
   return salarioBruto - totalDescontos;
 }
killedBy: Funções de salário calcula salário líquido com descontos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4000
Received: 6000

[Killed] ArithmeticOperator
src/salarios.ts:3:10
 export function calcularSalarioLiquido(salarioBruto: number, descontos: number[]): number {
   const totalDescontos = descontos.reduce((acc, curr) => acc + curr, 0);
-  return salarioBruto - totalDescontos;
+  return salarioBruto + totalDescontos;
 }
 
killedBy: Funções de salário calcula salário líquido com descontos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4000
Received: 6000
