[Killed] BlockStatement
src/utilidades.ts:1:54
-export function formatarMoeda(valor: number): string {
-  return valor.toLocaleString('pt-BR', { style: 'currency', currency: 'BRL' });
-}
+export function formatarMoeda(valor: number): string {}
 
 export function definirCategoriaIdade(idade: number): string {
killedBy: Funções utilitárias formata número como moeda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "R$ 1.234,56"
Received: undefined

[Killed] StringLiteral
src/utilidades.ts:2:71
 export function formatarMoeda(valor: number): string {
-  return valor.toLocaleString('pt-BR', { style: 'currency', currency: 'BRL' });
+  return valor.toLocaleString('pt-BR', { style: 'currency', currency: "" });
 }
 
killedBy: Funções utilitárias formata número como moeda
statusReason: RangeError: Invalid currency code :

[Killed] ObjectLiteral
src/utilidades.ts:2:40
 export function formatarMoeda(valor: number): string {
-  return valor.toLocaleString('pt-BR', { style: 'currency', currency: 'BRL' });
+  return valor.toLocaleString('pt-BR', {});
 }
 
killedBy: Funções utilitárias formata número como moeda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "R$ 1.234,56"
Received: "1.234,56"

[Killed] BlockStatement
src/utilidades.ts:5:62
   return valor.toLocaleString('pt-BR', { style: 'currency', currency: 'BRL' });
 }
 
-export function definirCategoriaIdade(idade: number): string {
-  switch (true) {
-    // Criança: entre 0 e 12 anos
-    case (idade < 13):
-      return 'criança';
-    // Adolescente: entre 13 e 17 anos
-    case (idade < 18):
-      return 'adolescente';
-    // Adulto: entre 18 e 59 anos
-    case (idade <= 60):
-      return 'adulto';
-    // Idoso: 60 anos ou mais
-    default:
-      return 'idoso';
-  }
-}
+export function definirCategoriaIdade(idade: number): string {}
 
 
killedBy: Funções utilitárias classifica corretamente a idade 5 como criança
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "criança"
Received: undefined

[Killed] BooleanLiteral
src/utilidades.ts:6:11
 }
 
 export function definirCategoriaIdade(idade: number): string {
-  switch (true) {
+  switch (false) {
     // Criança: entre 0 e 12 anos
     case (idade < 13):
killedBy: Funções utilitárias classifica corretamente a idade 5 como criança
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "criança"
Received: "idoso"

[Killed] ConditionalExpression
src/utilidades.ts:8:5
 export function definirCategoriaIdade(idade: number): string {
   switch (true) {
     // Criança: entre 0 e 12 anos
-    case (idade < 13):
-      return 'criança';
+    // Criança: entre 0 e 12 anos
+case idade < 13:
+// Adolescente: entre 13 e 17 anos
     // Adolescente: entre 13 e 17 anos
     case (idade < 18):
killedBy: Funções utilitárias classifica corretamente a idade 5 como criança
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "criança"
Received: "adolescente"

[Killed] ConditionalExpression
src/utilidades.ts:8:11
 export function definirCategoriaIdade(idade: number): string {
   switch (true) {
     // Criança: entre 0 e 12 anos
-    case (idade < 13):
+    case (true):
       return 'criança';
     // Adolescente: entre 13 e 17 anos
killedBy: Funções utilitárias classifica corretamente a idade 13 como adolescente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "adolescente"
Received: "criança"

[Killed] EqualityOperator
src/utilidades.ts:11:11
     case (idade < 13):
       return 'criança';
     // Adolescente: entre 13 e 17 anos
-    case (idade < 18):
+    case (idade >= 18):
       return 'adolescente';
     // Adulto: entre 18 e 59 anos
killedBy: Funções utilitárias classifica corretamente a idade 13 como adolescente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "adolescente"
Received: "adulto"

[Killed] ConditionalExpression
src/utilidades.ts:11:5
     case (idade < 13):
       return 'criança';
     // Adolescente: entre 13 e 17 anos
-    case (idade < 18):
-      return 'adolescente';
+    // Adolescente: entre 13 e 17 anos
+case idade < 18:
+// Adulto: entre 18 e 59 anos
     // Adulto: entre 18 e 59 anos
     case (idade <= 60):
killedBy: Funções utilitárias classifica corretamente a idade 13 como adolescente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "adolescente"
Received: "adulto"

[Killed] ConditionalExpression
src/utilidades.ts:14:5
     case (idade < 18):
       return 'adolescente';
     // Adulto: entre 18 e 59 anos
-    case (idade <= 60):
-      return 'adulto';
+    // Adulto: entre 18 e 59 anos
+case idade <= 60:
+// Idoso: 60 anos ou mais
     // Idoso: 60 anos ou mais
     default:
killedBy: Funções utilitárias classifica corretamente a idade 30 como adulto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "adulto"
Received: "idoso"

[Killed] EqualityOperator
src/utilidades.ts:14:11
     case (idade < 18):
       return 'adolescente';
     // Adulto: entre 18 e 59 anos
-    case (idade <= 60):
+    case (idade > 60):
       return 'adulto';
     // Idoso: 60 anos ou mais
killedBy: Funções utilitárias classifica corretamente a idade 30 como adulto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "adulto"
Received: "idoso"

[Killed] ConditionalExpression
src/utilidades.ts:17:5
     case (idade <= 60):
       return 'adulto';
     // Idoso: 60 anos ou mais
-    default:
-      return 'idoso';
+    // Idoso: 60 anos ou mais
+default:
   }
 }
killedBy: Funções utilitárias classifica corretamente a idade 75 como idoso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "idoso"
Received: undefined
