[Killed] BlockStatement
src/impostos.ts:1:58
-export function calcularImposto(salario: number): number {
-  const aliquota = 0.01788;
-  return salario * aliquota;
-}
+export function calcularImposto(salario: number): number {}
 
killedBy: Funções de impostos calcula imposto corretamente
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/impostos.ts:3:10
 export function calcularImposto(salario: number): number {
   const aliquota = 0.01788;
-  return salario * aliquota;
+  return salario / aliquota;
 }
 
killedBy: Funções de impostos calcula imposto corretamente
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 44.7
Received: 139821.02908277404

Expected precision:    1
Expected difference: < 0.05
Received difference:   139776.32908277403
